AK47n/firstep/library/masters/mspm0/mspm0.syscfg
// 启动按键输入（实例名 KEY → KEY_PORT 宏；引脚名 START → KEY_START_PIN）
KEY.$name = "KEY";
KEY.associatedPins.create(1);
KEY.associatedPins[0].$name       = "START";
KEY.associatedPins[0].direction   = "INPUT";
KEY.associatedPins[0].pin.$assign = "PA2";

// 红外对射传感器输入（ir_beam 模块：实例名 IR_BEAM → IR_BEAM_PORT 宏；
// 引脚名 OUT → IR_BEAM_OUT_PIN；默认 PA8——仅与 DIGIT_UART 默认重叠，
// 同选时经引脚绑定消解；内部上拉 = 遮挡（开集输出截止）时由电阻钳到高，
// 无遮挡 = 接收管导通拉低）
IR_BEAM.$name = "IR_BEAM";
IR_BEAM.associatedPins.create(1);
IR_BEAM.associatedPins[0].$name            = "OUT";
IR_BEAM.associatedPins[0].direction        = "INPUT";
IR_BEAM.associatedPins[0].internalResistor = "PULL_UP";
IR_BEAM.associatedPins[0].pin.$assign      = "PA8";

// WS2812 幻彩灯带数据脚（ws2812 模块：单 GPIO 强推挽输出，位操作时序；
// 默认 PA14——与 DCC_100_PWM2（step_motor 脉冲）默认重叠，同选时经引脚
// 绑定消解。地猛星 2×20 排针 31 个 IO 已被母版默认布局全占，新模块默认
// 脚按「与同选概率最低者重叠」分配，IR_BEAM/PA8 先例）
WS2812.$name = "WS2812";
WS2812.associatedPins.create(1);
WS2812.associatedPins[0].$name        = "IN";
WS2812.associatedPins[0].direction    = "OUTPUT";
WS2812.associatedPins[0].initialValue = "CLEARED";
WS2812.associatedPins[0].pin.$assign  = "PA14";

// HX711 称重（hx711 模块：SCK 输出 / DT 输入（片上拉，空闲高 = 未就绪，
// 数据就绪拉低）。默认 SCK=PA28（与 IMU601 TX 重叠）、DT=PA31（与 IMU601
// RX 重叠）——称重与串口陀螺仪同为「姿态/力」低频组合，同选概率最低；
// 同选时经引脚绑定消解）
HX711.$name = "HX711";
HX711.associatedPins.create(2);
HX711.associatedPins[0].$name        = "SCK";
HX711.associatedPins[0].direction    = "OUTPUT";
HX711.associatedPins[0].initialValue = "CLEARED";
HX711.associatedPins[0].pin.$assign  = "PA28";
HX711.associatedPins[1].$name        = "DT";
HX711.associatedPins[1].direction    = "INPUT";
HX711.associatedPins[1].internalResistor = "PULL_UP";
HX711.associatedPins[1].pin.$assign  = "PA31";

// AHT10 温湿度软 I2C（aht10 模块：SCL 输出 / SDA 双向运行时切换；
// 位操作不占硬件 I2C 外设。默认 SCL=PB6（与 STEP_MOTOR SLP2 / HUIDU R3
// 重叠）、SDA=PB7（与 STEP_MOTOR DIR2 / HUIDU R4 重叠）——温湿度与步进/
// 巡线同选概率最低，同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）
AHT10.$name = "AHT10";
AHT10.associatedPins.create(2);
AHT10.associatedPins[0].$name        = "SCL";
AHT10.associatedPins[0].direction    = "OUTPUT";
AHT10.associatedPins[0].initialValue = "CLEARED";
AHT10.associatedPins[0].pin.$assign  = "PB6";
AHT10.associatedPins[1].$name        = "SDA";
AHT10.associatedPins[1].direction    = "OUTPUT";
AHT10.associatedPins[1].initialValue = "CLEARED";
AHT10.associatedPins[1].pin.$assign  = "PB7";
// 双轴摇杆按键（joystick 模块：SW 输入上拉低有效；实例名 JOYSTICK →
// JOYSTICK_PORT 宏；引脚名 SW → JOYSTICK_SW_PIN；默认 PA9——仅与
// DIGIT_UART RX 默认重叠（K230 视觉串口），同选时经引脚绑定消解。
// X/Y 两轴走 ADC12_0 MEM1/MEM2（见 ADC 段），SW 独立 GPIO）
JOYSTICK.$name = "JOYSTICK";
JOYSTICK.associatedPins.create(1);
JOYSTICK.associatedPins[0].$name            = "SW";
JOYSTICK.associatedPins[0].direction        = "INPUT";
JOYSTICK.associatedPins[0].internalResistor = "PULL_UP";
JOYSTICK.associatedPins[0].pin.$assign  = "PA9";

// LED/蜂鸣器输出（PA15；原 LaunchPad 值 PA3 = 32.768k 晶振脚，地猛星排针未引出）
LED_BEEP.$name = "LED_BEEP";
LED_BEEP.associatedPins.create(1);
LED_BEEP.associatedPins[0].$name        = "LED";
LED_BEEP.associatedPins[0].direction    = "OUTPUT";
LED_BEEP.associatedPins[0].initialValue = "CLEARED";
LED_BEEP.associatedPins[0].pin.$assign  = "PA15";

// 步进电机方向/使能（step_motor 模块：宏 STEP_MOTOR_RST2/SLP2/DIR2/DCY2_PIN，
// 四脚同 GPIOB → STEP_MOTOR_PORT = GPIOB；RST2/SLP2 空闲高有效，init 置高）
STEP_MOTOR.$name = "STEP_MOTOR";
STEP_MOTOR.associatedPins.create(4);
STEP_MOTOR.associatedPins[0].$name        = "RST2";
STEP_MOTOR.associatedPins[0].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[0].initialValue = "SET";
STEP_MOTOR.associatedPins[0].pin.$assign  = "PB24";
STEP_MOTOR.associatedPins[1].$name        = "SLP2";
STEP_MOTOR.associatedPins[1].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[1].initialValue = "SET";
STEP_MOTOR.associatedPins[1].pin.$assign  = "PB6";
STEP_MOTOR.associatedPins[2].$name        = "DIR2";
STEP_MOTOR.associatedPins[2].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[2].initialValue = "CLEARED";
STEP_MOTOR.associatedPins[2].pin.$assign  = "PB7";
STEP_MOTOR.associatedPins[3].$name        = "DCY2";
STEP_MOTOR.associatedPins[3].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[3].initialValue = "CLEARED";
STEP_MOTOR.associatedPins[3].pin.$assign  = "PB8";

// IMU 串口（RX 中断；UART0 = PA28(TX)/PA31(RX)——板载 CH340E 占用 UART0 默认脚
// PA10/PA11，勿用；imu_uart 模块接线注释同步此值）
IMU601.$name             = "IMU601";
IMU601.profile           = "CONFIG_PROFILE_1";
IMU601.peripheral.$assign = "UART0";
IMU601.uartClkSrc        = "BUSCLK";
IMU601.ovsRate           = "16";
IMU601.targetBaudRate    = 115200;
IMU601.enableInternalLoopback = false;
IMU601.enabledInterrupts = ["RX"];
IMU601.enableFIFO        = false;
IMU601.peripheral.rxPin.$assign = "PA31";
IMU601.peripheral.txPin.$assign = "PA28";

// K230 视觉串口（digit_uart/coord_detect 模块用，RX 中断；PA8/PA9 = UART1）
const DIGIT_UART = UART.addInstance();
DIGIT_UART.$name             = "DIGIT_UART";
DIGIT_UART.profile           = "CONFIG_PROFILE_1";
DIGIT_UART.peripheral.$assign = "UART1";
DIGIT_UART.uartClkSrc        = "BUSCLK";
DIGIT_UART.ovsRate           = "16";
DIGIT_UART.targetBaudRate    = 115200;
DIGIT_UART.enableInternalLoopback = false;
DIGIT_UART.enabledInterrupts = ["RX"];
DIGIT_UART.enableFIFO        = false;
DIGIT_UART.peripheral.rxPin.$assign = "PA9";
DIGIT_UART.peripheral.txPin.$assign = "PA8";

// 调试串口（debug_uart 模块用，RX 中断；UART2 = PA23(TX)/PA22(RX)。
// 与 UWB_UART 默认同 UART2——两模块同选时经引脚绑定换实例消解；
// PA23/PA22 与 HUIDU L2/L1 默认重叠，同选时改绑消解）
const DEBUG_UART = UART.addInstance();
DEBUG_UART.$name             = "DEBUG_UART";
DEBUG_UART.profile           = "CONFIG_PROFILE_1";
DEBUG_UART.peripheral.$assign = "UART2";
DEBUG_UART.uartClkSrc        = "BUSCLK";
DEBUG_UART.ovsRate           = "16";
DEBUG_UART.targetBaudRate    = 115200;
DEBUG_UART.enableInternalLoopback = false;
DEBUG_UART.enabledInterrupts = ["RX"];
DEBUG_UART.enableFIFO        = false;
DEBUG_UART.peripheral.rxPin.$assign = "PA22";
DEBUG_UART.peripheral.txPin.$assign = "PA23";

// UWB 定位串口（uwb_uart 模块用，RX 中断；UART2 = PA23(TX)/PA24(RX)。
// PA23/PA24 与 HUIDU L2/L3 默认重叠——两模块同选时经引脚绑定消解）
const UWB_UART = UART.addInstance();
UWB_UART.$name             = "UWB_UART";
UWB_UART.profile           = "CONFIG_PROFILE_1";
UWB_UART.peripheral.$assign = "UART2";
UWB_UART.uartClkSrc        = "BUSCLK";
UWB_UART.ovsRate           = "16";
UWB_UART.targetBaudRate    = 115200;
UWB_UART.enableInternalLoopback = false;
UWB_UART.enabledInterrupts = ["RX"];
UWB_UART.enableFIFO        = false;
UWB_UART.peripheral.rxPin.$assign = "PA24";
UWB_UART.peripheral.txPin.$assign = "PA23";

// Zigbee DL-20 串口（zigbee_uart 接收 / zigbee_uart_key 发送共享，
// RX 中断；UART3 = PA26(TX)/PA25(RX)。PA26/PA25 与 HUIDU R2/R3 默认
// 重叠——同选时经引脚绑定消解）
const ZIGBEE_UART = UART.addInstance();
ZIGBEE_UART.$name             = "ZIGBEE_UART";
ZIGBEE_UART.profile           = "CONFIG_PROFILE_1";
ZIGBEE_UART.peripheral.$assign = "UART3";
ZIGBEE_UART.uartClkSrc        = "BUSCLK";
ZIGBEE_UART.ovsRate           = "16";
ZIGBEE_UART.targetBaudRate    = 115200;
ZIGBEE_UART.enableInternalLoopback = false;
ZIGBEE_UART.enabledInterrupts = ["RX"];
ZIGBEE_UART.enableFIFO        = false;
ZIGBEE_UART.peripheral.rxPin.$assign = "PA25";
ZIGBEE_UART.peripheral.txPin.$assign = "PA26";

// OLED（I2C 控制器）
OLED.$name                         = "OLED";
OLED.basicEnableController         = true;
OLED.basicControllerBusSpeed       = 400000;
OLED.intController                 = ["NACK", "TX_DONE"];
OLED.advAnalogGlitchFilter         = "DISABLED";
OLED.peripheral.$assign            = "I2C1";
OLED.peripheral.sdaPin.$assign     = "PB3";
OLED.peripheral.sclPin.$assign     = "PB2";

// MPU6050 姿态传感器（ml_mpu6050 模块：I2C_0_INST，轮询控制器模式；
// I2C0 = PA0(SDA)/PA1(SCL) 复用板载 LED 脚，通信期间 LED 微闪——地猛星 I2C0 的
// 另一组 PA28/PA31 已给 IMU601 UART0；PA1 板载 4.7k 上拉，PA0 上拉未焊 R12、
// 依赖 MPU6050 模块板自带）
I2C_0.$name                     = "I2C_0";
I2C_0.basicEnableController     = true;
I2C_0.basicControllerBusSpeed   = 400000;
I2C_0.peripheral.$assign        = "I2C0";
I2C_0.peripheral.sdaPin.$assign = "PA0";
I2C_0.peripheral.sclPin.$assign = "PA1";

// adc 模块 + 摇杆共享 ADC12_0（b1-adc-servo/01 + wiki-modules-batch1/01：
// MEM0=PA24/A0_3 归 adc，MEM1=PA26/A0_1、MEM2=PA25/A0_2 归 joystick X/Y；
// 轮询读取不配中断。多 MEM 必须 sequence 模式（startAdd..endAdd = 启用
// MEM 集合）——单发模式只启用 startAdd 槽位，adcPin1/2 由此不可用（原注释
// 「槽位不存在」系误判，2026-09-05 SysConfig CLI 实证）
const ADC12   = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC12_0 = ADC12.addInstance();
ADC12_0.$name                      = "ADC12_0";
ADC12_0.sampClkSrc                 = "DL_ADC12_CLOCK_ULPCLK";
ADC12_0.sampClkDiv                 = "DL_ADC12_CLOCK_DIVIDE_8";
ADC12_0.sampleTime0                = "125 us";
ADC12_0.powerDownMode              = "DL_ADC12_POWER_DOWN_MODE_MANUAL";
ADC12_0.adcMem0chansel             = "DL_ADC12_INPUT_CHAN_3";
ADC12_0.adcMem1chansel             = "DL_ADC12_INPUT_CHAN_1";
ADC12_0.adcMem2chansel             = "DL_ADC12_INPUT_CHAN_2";
ADC12_0.samplingOperationMode      = "sequence";
ADC12_0.startAdd                   = 0;
ADC12_0.endAdd                     = 2;
ADC12_0.peripheral.$assign         = "ADC0";
ADC12_0.peripheral.adcPin3.$assign = "PA24";
ADC12_0.peripheral.adcPin1.$assign  = "PA26";
ADC12_0.peripheral.adcPin2.$assign  = "PA25";
const Board = scripting.addModule("/ti/driverlib/Board", {}, false);
Board.configureUnused = true;

SYSCTL.forceDefaultClkConfig = true;
SYSCTL.clockTreeEn  = true;
